app/Models/libs_model.php

INSERT INTO `lib` (`nombre`, `paginas`, `autor`) VALUES ('2', '2', '2')
---
    public function insertdata($data){
        #print_r($data);
        $this->builder->insert($data);